notebook-org/java/ReentrantLock.org
#+TITLE: ReentrantLock 源码分析
#+LANGUAGE: en
#+OPTIONS: H:3 num:nil toc:t \n:t

环境: [[http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d][jdk8]]

* 使用方式
#+BEGIN_SRC java
class X {
  private final ReentrantLock lock = new ReentrantLock();
  // ...
  public void m() {
    lock.lock();  // block until condition holds
    try {
      // ... method body
    } finally {
      lock.unlock()
    }
  }
}
#+END_SRC

* ReentrantLock 定义
顾名思义, ReentrantLock 为重入锁, 意味着一个线程可以多次获得锁而不会阻塞, 类的基本定义如下.
#+BEGIN_SRC java
// ReentrantLock.java
public class ReentrantLock implements Lock, java.io.Serializable {
    private final Sync sync;
    abstract static class Sync extends AbstractQueuedSynchronizer {...}
    /* 非公平实现 */
    static final class NonfairSync extends Sync {...}
    /* 公平实现 */
    static final class FairSync extends Sync {...}

    public ReentrantLock() {
        sync = new NonfairSync(); /* 默认是非公平的 */
    }
    public ReentrantLock(boolean fair) {
        sync = fair ? new FairSync() : new NonfairSync();
    }
}
#+END_SRC

* NonfairSync
