notebook/java/ReentrantLock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-13 Thu 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ReentrantLock 源码分析</title>
<meta name="author" content="Saul Lawliet" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ReentrantLock 源码分析</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf85db08">使用方式</a></li>
<li><a href="#orge45a2b1">ReentrantLock 定义</a></li>
<li><a href="#org094c4b6">NonfairSync</a>
<ul>
<li><a href="#orgd6e0346">lock() 方法</a></li>
<li><a href="#orga6fb05e">unlock() 方法</a></li>
</ul>
</li>
<li><a href="#orgeaf5610">FairSync</a>
<ul>
<li><a href="#orgc9e9f9e">lock() 方法</a></li>
<li><a href="#org1a6600d">unlock() 方法</a></li>
</ul>
</li>
<li><a href="#org8d741b9">小结</a></li>
</ul>
</div>
</div>
<p>
环境: <a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d">jdk8</a><br />
</p>

<div id="outline-container-orgf85db08" class="outline-2">
<h2 id="orgf85db08">使用方式</h2>
<div class="outline-text-2" id="text-orgf85db08">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">X</span> {
  <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">ReentrantLock</span> <span style="color: #dcaeea;">lock</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">ReentrantLock</span>();
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">...</span>
  <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">m</span>() {
    lock.lock();  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">block until condition holds</span>
    <span style="color: #51afef;">try</span> {
      <span style="color: #5B6268;">// </span><span style="color: #5B6268;">... method body</span>
    } <span style="color: #51afef;">finally</span> {
      lock.unlock()
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge45a2b1" class="outline-2">
<h2 id="orge45a2b1">ReentrantLock 定义</h2>
<div class="outline-text-2" id="text-orge45a2b1">
<p>
顾名思义, ReentrantLock 为重入锁, 意味着一个线程可以多次获得锁而不会阻塞, 类的基本定义如下.<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">ReentrantLock</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Lock</span>, <span style="color: #a9a1e1;">java</span>.<span style="color: #a9a1e1;">io</span>.<span style="color: #ECBE7B;">Serializable</span> {
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Sync</span> <span style="color: #dcaeea;">sync</span>;
    <span style="color: #51afef;">abstract</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Sync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">AbstractQueuedSynchronizer</span> {...}
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#38750;&#20844;&#24179;&#23454;&#29616;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">NonfairSync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Sync</span> {...}
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20844;&#24179;&#23454;&#29616;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">FairSync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Sync</span> {...}

    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">ReentrantLock</span>() {
        sync = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">NonfairSync</span>(); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#40664;&#35748;&#26159;&#38750;&#20844;&#24179;&#30340;</span><span style="color: #5B6268;"> */</span>
    }
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">ReentrantLock</span>(<span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">fair</span>) {
        sync = fair ? <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">FairSync</span>() : <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">NonfairSync</span>();
    }
}
</pre>
</div>
</div>
</div>
