notebook/java/ReentrantLock.html

<div id="outline-container-org094c4b6" class="outline-2">
<h2 id="org094c4b6">NonfairSync</h2>
<div class="outline-text-2" id="text-org094c4b6">
</div>
<div id="outline-container-orgd6e0346" class="outline-3">
<h3 id="orgd6e0346">lock() 方法</h3>
<div class="outline-text-3" id="text-orgd6e0346">
<p>
注意 Sync 继承于 AbstractQueuedSynchronizer, AQS 是许多并发类的核心.<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java</span>
<span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">lock</span>() {
    sync.lock();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java NonfairSync</span>
<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">lock</span>() {
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22312;&#27492;&#27169;&#24335;&#19979; state=0 &#34920;&#31034;&#24403;&#21069;&#27809;&#26377;&#32447;&#31243;&#21344;&#29992;&#38145;, state&gt;0 &#34920;&#31034;&#24403;&#21069;&#32447;&#31243;&#33719;&#21462;&#20102;&#20960;&#27425;&#38145;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">if</span> (compareAndSetState(<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1</span>))
        setExclusiveOwnerThread(Thread.currentThread());
    <span style="color: #51afef;">else</span>
        acquire(<span style="color: #da8548; font-weight: bold;">1</span>);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22312;&#29420;&#21344;&#27169;&#24335;&#20013;, &#33719;&#21462;&#38145;, &#22914;&#26524;&#22833;&#36133;, &#21017;&#25226;&#24403;&#21069;&#32447;&#31243;&#21152;&#20837;&#38431;&#21015;, &#38459;&#22622;&#21040;&#25104;&#21151;&#20026;&#27490;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>tryAcquire(arg) &amp;&amp; acquireQueued(addWaiter(<span style="color: #a9a1e1;">Node</span>.EXCLUSIVE), arg))
        selfInterrupt();
}

</pre>
</div>

<p>
tryAcquire(arg), 尝试获取一次锁<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryAcquire</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">UnsupportedOperationException</span>();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java NonfairSync</span>
<span style="color: #51afef;">protected</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryAcquire</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">return</span> nonfairTryAcquire(acquires);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java Sync</span>
<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">nonfairTryAcquire</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Thread</span> <span style="color: #dcaeea;">current</span> = Thread.currentThread();
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20877;&#27425;&#25343;&#21040; state, &#21028;&#26029;&#26159;&#21542;&#20026;0, &#21487;&#33021;&#22312;&#25191;&#34892;&#20195;&#30721;&#30340;&#36807;&#31243;&#20013;&#21407;&#26469;&#21344;&#29992;&#38145;&#30340;&#32447;&#31243;&#37322;&#25918;&#20102;&#38145;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">c</span> = getState();
    <span style="color: #51afef;">if</span> (c == <span style="color: #da8548; font-weight: bold;">0</span>) {
        <span style="color: #51afef;">if</span> (compareAndSetState(<span style="color: #da8548; font-weight: bold;">0</span>, acquires)) {
            setExclusiveOwnerThread(current);
            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
        }
    }
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22914;&#26524;&#24403;&#21069;&#32447;&#31243;&#26159;&#25345;&#26377;&#38145;&#30340;&#32447;&#31243; state+1</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> (current == getExclusiveOwnerThread()) {
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nextc</span> = c + acquires;
        <span style="color: #51afef;">if</span> (nextc &lt; <span style="color: #da8548; font-weight: bold;">0</span>) <span style="color: #5B6268;">// </span><span style="color: #5B6268;">overflow</span>
            <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Error</span>(<span style="color: #98be65;">"Maximum lock count exceeded"</span>);
        setState(nextc);
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
}
</pre>
</div>

<p>
在继续往下之前, 先看一下源码文档中的队列图示<br />
</p>
<pre class="example" id="orgb468852">
     +------+  prev +-----+       +-----+
head |      | &lt;---- |     | &lt;---- |     |  tail
     +------+       +-----+       +-----+

注意: head是一个空节点, 0值的概念
</pre>

<p>
addWaiter(Node.EXCLUSIVE)<br />
创建一个当前线程的 node, 并且加入队列. 该方法一定成功.<br />
</p>
<ul class="org-ul">
<li>Node.EXCLUSIVE 独占模式<br /></li>
<li>Node.SHARED    共享模式<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #c678dd;">addWaiter</span>(<span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">mode</span>) {
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Node</span>(Thread.currentThread(), mode);
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#29702;&#35770;&#19978;&#21435;&#25481;&#19979;&#38754;&#30340;&#36825;&#27573;&#20195;&#30721;, &#23545;&#32467;&#26524;&#30340;&#27491;&#30830;&#24615;&#19981;&#20250;&#20135;&#29983;&#24433;&#21709;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Try the fast path of enq; backup to full enq on failure</span>
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">pred</span> = tail;
    <span style="color: #51afef;">if</span> (pred != <span style="color: #a9a1e1;">null</span>) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#27492;&#26102;&#38431;&#21015;&#24050;&#32463;&#26377;&#20854;&#20182;&#32447;&#31243;&#22312;&#25490;&#38431;, &#30452;&#25509;&#25554;&#20837;&#38431;&#23614;</span><span style="color: #5B6268;"> */</span>
        node.prev = pred;
        <span style="color: #51afef;">if</span> (compareAndSetTail(pred, node)) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21407;&#23376;&#25805;&#20316;</span><span style="color: #5B6268;"> */</span>
            pred.next = node;
            <span style="color: #51afef;">return</span> node;
        }
    }
    enq(node);
    <span style="color: #51afef;">return</span> node;
}

<span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23558; node &#25918;&#20837;&#38431;&#21015;</span><span style="color: #5B6268;"> */</span>
<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #c678dd;">enq</span>(<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span>) {
    <span style="color: #51afef;">for</span> (;;) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#19981;&#26029;&#23581;&#35797;, &#30452;&#21040;&#25104;&#21151;&#20026;&#27490;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">t</span> = tail;
        <span style="color: #51afef;">if</span> (t == <span style="color: #a9a1e1;">null</span>) { <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Must initialize</span>
            <span style="color: #51afef;">if</span> (compareAndSetHead(<span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Node</span>())) <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21021;&#22987;&#21270; head, &#19968;&#20010;'&#38646;&#20540;'&#30340; node</span><span style="color: #5B6268;"> */</span>
                tail = head;
        } <span style="color: #51afef;">else</span> {
            node.prev = t;
            <span style="color: #51afef;">if</span> (compareAndSetTail(t, node)) {
                t.next = node;
                <span style="color: #51afef;">return</span> t; <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#25104;&#21151;&#25918;&#20837;&#38431;&#23614;, &#32467;&#26463;&#24490;&#29615;</span><span style="color: #5B6268;"> */</span>
            }
        }
    }
}
</pre>
</div>

<p>
acquireQueued(addWaiter(Node.EXCLUSIVE), arg)<br />
独占模式下, 线程已经加入队列, 堵塞直到获取到锁.<br />
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">acquireQueued</span>(<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">failed</span> = <span style="color: #a9a1e1;">true</span>;
    <span style="color: #51afef;">try</span> {
        <span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">interrupted</span> = <span style="color: #a9a1e1;">false</span>;
        <span style="color: #51afef;">for</span> (;;) {
            <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">p</span> = node.predecessor();
            <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20165;&#24403;&#19978;&#20010;&#33410;&#28857;&#26159;&#22836;&#33410;&#28857;&#24182;&#19988;&#25343;&#21040;&#20102;&#38145;, &#21017;&#36820;&#22238;</span><span style="color: #5B6268;"> */</span>
            <span style="color: #51afef;">if</span> (p == head &amp;&amp; tryAcquire(arg)) {
                setHead(node); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#25226;&#24403;&#21069;node&#35774;&#32622;&#25104;&#22836;&#33410;&#28857;, &#24182;&#28165;&#31354;&#25968;&#25454;, &#20351;&#20043;&#25104;&#20026;'&#38646;&#20540;'</span><span style="color: #5B6268;"> */</span>
                p.next = <span style="color: #a9a1e1;">null</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">help GC</span>
                failed = <span style="color: #a9a1e1;">false</span>;
                <span style="color: #51afef;">return</span> interrupted;
            }
            <span style="color: #51afef;">if</span> (shouldParkAfterFailedAcquire(p, node) &amp;&amp;
                parkAndCheckInterrupt()) <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#30001;&#35813;&#26041;&#27861;&#38459;&#22622;&#32447;&#31243;</span><span style="color: #5B6268;"> */</span>
                interrupted = <span style="color: #a9a1e1;">true</span>;
        }
    } <span style="color: #51afef;">finally</span> {
        <span style="color: #51afef;">if</span> (failed)
            cancelAcquire(node);
    }
}

<span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21482;&#26377;&#21069;&#39537;&#33410;&#28857;&#30340;&#29366;&#24577;&#26159; SIGNAL &#26102;, &#25165;&#36820;&#22238; true, &#34920;&#31034;&#21487;&#20197; park. &#21542;&#21017;&#36820;&#22238; false</span><span style="color: #5B6268;"> */</span>
<span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">shouldParkAfterFailedAcquire</span>(<span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">pred</span>, <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span>) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ws</span> = pred.waitStatus;
    <span style="color: #51afef;">if</span> (ws == <span style="color: #a9a1e1;">Node</span>.SIGNAL)
        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * This node has already set status asking a release</span>
<span style="color: #5B6268;">         * to signal it, so it can safely park.</span>
<span style="color: #5B6268;">         */</span>
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    <span style="color: #51afef;">if</span> (ws &gt; <span style="color: #da8548; font-weight: bold;">0</span>) {
        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * Predecessor was cancelled. Skip over predecessors and</span>
<span style="color: #5B6268;">         * indicate retry.</span>
<span style="color: #5B6268;">         */</span>
        <span style="color: #51afef;">do</span> {
            node.prev = pred = pred.prev;
        } <span style="color: #51afef;">while</span> (pred.waitStatus &gt; <span style="color: #da8548; font-weight: bold;">0</span>);
        pred.next = node;
    } <span style="color: #51afef;">else</span> {
        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * waitStatus must be 0 or PROPAGATE.  Indicate that we</span>
<span style="color: #5B6268;">         * need a signal, but don't park yet.  Caller will need to</span>
<span style="color: #5B6268;">         * retry to make sure it cannot acquire before parking.</span>
<span style="color: #5B6268;">         */</span>
        compareAndSetWaitStatus(pred, ws, <span style="color: #a9a1e1;">Node</span>.SIGNAL);
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
}

<span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">parkAndCheckInterrupt</span>() {
    LockSupport.park(<span style="color: #51afef;">this</span>);
    <span style="color: #51afef;">return</span> Thread.interrupted();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">LockSupport.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">park</span>(<span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">blocker</span>) {
    <span style="color: #ECBE7B;">Thread</span> <span style="color: #dcaeea;">t</span> = Thread.currentThread();
    setBlocker(t, blocker);
    UNSAFE.park(<span style="color: #a9a1e1;">false</span>, 0L); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#32447;&#31243;&#38459;&#22622;&#30452;&#21040;&#33719;&#21462;&#35768;&#21487;</span><span style="color: #5B6268;"> */</span>
    setBlocker(t, <span style="color: #a9a1e1;">null</span>);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Unsafe.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">native</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">park</span>(<span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">isAbsolute</span>, <span style="color: #ECBE7B;">long</span> <span style="color: #dcaeea;">time</span>);
</pre>
</div>
</div>
</div>
