notebook-org/java/ReentrantLock.org
** unlock() 方法
#+BEGIN_SRC java
// ReentrantLock.java
public void unlock() {
    sync.release(1);
}

// AbstractQueuedSynchronizer.java
public final boolean release(int arg) {
    if (tryRelease(arg)) { /* 尝试释放锁 */
        Node h = head;
        if (h != null && h.waitStatus != 0)
            unparkSuccessor(h); /* 尝试唤醒下一个节点 */
        return true;
    }
    return false;
}

protected boolean tryRelease(int arg) {
    throw new UnsupportedOperationException();
}

// ReentrantLock.java Sync
protected final boolean tryRelease(int releases) {
    int c = getState() - releases;
    if (Thread.currentThread() != getExclusiveOwnerThread())
        throw new IllegalMonitorStateException();
    boolean free = false;
    if (c == 0) { /* 因为可重入锁, 所以c可能大于0, 当等于0时, 表示当前线程已经正在释放锁 */
        free = true;
        setExclusiveOwnerThread(null); /* 设置拥有锁的线程为 null */
    }
    setState(c);
    return free;
}
#+END_SRC

unparkSuccessor(h) 唤醒下一个节点
#+BEGIN_SRC java
// AbstractQueuedSynchronizer.java
private void unparkSuccessor(Node node) {
    /*
     * If status is negative (i.e., possibly needing signal) try
     * to clear in anticipation of signalling.  It is OK if this
     * fails or if status is changed by waiting thread.
     */
    int ws = node.waitStatus;
    if (ws < 0)
        compareAndSetWaitStatus(node, ws, 0);

    /*
     * Thread to unpark is held in successor, which is normally
     * just the next node.  But if cancelled or apparently null,
     * traverse backwards from tail to find the actual
     * non-cancelled successor.
     */
    /* 尽可能从头开始找到一个合适的 node */
    Node s = node.next;
    if (s == null || s.waitStatus > 0) {
        s = null;
        for (Node t = tail; t != null && t != node; t = t.prev)
            if (t.waitStatus <= 0)
                s = t;
    }
    if (s != null)
        LockSupport.unpark(s.thread); /* 唤醒 node 的线程 */
}

// LockSupport.java
public static void unpark(Thread thread) {
    if (thread != null)
        UNSAFE.unpark(thread);
}

// Unsafe.java
public native void unpark(Object thread);
#+END_SRC

* FairSync
详细代码在 NonfairSync 小节内已经贴过了, 本小节只贴变动的代码
