notebook/java/ReentrantLock.html

<div id="outline-container-orga6fb05e" class="outline-3">
<h3 id="orga6fb05e">unlock() 方法</h3>
<div class="outline-text-3" id="text-orga6fb05e">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java</span>
<span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">unlock</span>() {
    sync.release(<span style="color: #da8548; font-weight: bold;">1</span>);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">release</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">if</span> (tryRelease(arg)) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23581;&#35797;&#37322;&#25918;&#38145;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">h</span> = head;
        <span style="color: #51afef;">if</span> (h != <span style="color: #a9a1e1;">null</span> &amp;&amp; h.waitStatus != <span style="color: #da8548; font-weight: bold;">0</span>)
            unparkSuccessor(h); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23581;&#35797;&#21796;&#37266;&#19979;&#19968;&#20010;&#33410;&#28857;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
}

<span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryRelease</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">UnsupportedOperationException</span>();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java Sync</span>
<span style="color: #51afef;">protected</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryRelease</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">releases</span>) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">c</span> = getState() - releases;
    <span style="color: #51afef;">if</span> (Thread.currentThread() != getExclusiveOwnerThread())
        <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">IllegalMonitorStateException</span>();
    <span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">free</span> = <span style="color: #a9a1e1;">false</span>;
    <span style="color: #51afef;">if</span> (c == <span style="color: #da8548; font-weight: bold;">0</span>) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22240;&#20026;&#21487;&#37325;&#20837;&#38145;, &#25152;&#20197;c&#21487;&#33021;&#22823;&#20110;0, &#24403;&#31561;&#20110;0&#26102;, &#34920;&#31034;&#24403;&#21069;&#32447;&#31243;&#24050;&#32463;&#27491;&#22312;&#37322;&#25918;&#38145;</span><span style="color: #5B6268;"> */</span>
        free = <span style="color: #a9a1e1;">true</span>;
        setExclusiveOwnerThread(<span style="color: #a9a1e1;">null</span>); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#35774;&#32622;&#25317;&#26377;&#38145;&#30340;&#32447;&#31243;&#20026; null</span><span style="color: #5B6268;"> */</span>
    }
    setState(c);
    <span style="color: #51afef;">return</span> free;
}
</pre>
</div>

<p>
unparkSuccessor(h) 唤醒下一个节点<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">unparkSuccessor</span>(<span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span>) {
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">     * If status is negative (i.e., possibly needing signal) try</span>
<span style="color: #5B6268;">     * to clear in anticipation of signalling.  It is OK if this</span>
<span style="color: #5B6268;">     * fails or if status is changed by waiting thread.</span>
<span style="color: #5B6268;">     */</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ws</span> = node.waitStatus;
    <span style="color: #51afef;">if</span> (ws &lt; <span style="color: #da8548; font-weight: bold;">0</span>)
        compareAndSetWaitStatus(node, ws, <span style="color: #da8548; font-weight: bold;">0</span>);

    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">     * Thread to unpark is held in successor, which is normally</span>
<span style="color: #5B6268;">     * just the next node.  But if cancelled or apparently null,</span>
<span style="color: #5B6268;">     * traverse backwards from tail to find the actual</span>
<span style="color: #5B6268;">     * non-cancelled successor.</span>
<span style="color: #5B6268;">     */</span>
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23613;&#21487;&#33021;&#20174;&#22836;&#24320;&#22987;&#25214;&#21040;&#19968;&#20010;&#21512;&#36866;&#30340; node</span><span style="color: #5B6268;"> */</span>
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">s</span> = node.next;
    <span style="color: #51afef;">if</span> (s == <span style="color: #a9a1e1;">null</span> || s.waitStatus &gt; <span style="color: #da8548; font-weight: bold;">0</span>) {
        s = <span style="color: #a9a1e1;">null</span>;
        <span style="color: #51afef;">for</span> (<span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">t</span> = tail; t != <span style="color: #a9a1e1;">null</span> &amp;&amp; t != node; t = t.prev)
            <span style="color: #51afef;">if</span> (t.waitStatus &lt;= <span style="color: #da8548; font-weight: bold;">0</span>)
                s = t;
    }
    <span style="color: #51afef;">if</span> (s != <span style="color: #a9a1e1;">null</span>)
        LockSupport.unpark(s.thread); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21796;&#37266; node &#30340;&#32447;&#31243;</span><span style="color: #5B6268;"> */</span>
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">LockSupport.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">unpark</span>(<span style="color: #ECBE7B;">Thread</span> <span style="color: #dcaeea;">thread</span>) {
    <span style="color: #51afef;">if</span> (thread != <span style="color: #a9a1e1;">null</span>)
        UNSAFE.unpark(thread);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Unsafe.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">native</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">unpark</span>(<span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">thread</span>);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeaf5610" class="outline-2">
<h2 id="orgeaf5610">FairSync</h2>
<div class="outline-text-2" id="text-orgeaf5610">
<p>
详细代码在 NonfairSync 小节内已经贴过了, 本小节只贴变动的代码<br />
</p>
</div>
