notebook-org/java/ReentrantLock.org
** lock() 方法
#+BEGIN_SRC java
// ReentrantLock.java FairSync
final void lock() {
    /* 对比 NonfairSync 版本, 这里直接调用 acquire(), 避免了线程插队的问题 */
    acquire(1);
}

protected final boolean tryAcquire(int acquires) {
    final Thread current = Thread.currentThread();
    int c = getState();
    if (c == 0) {
        /* 对比 NonfairSync 版本, 只有这里多了一个判断 */
        /* 仅有队列为空 或者 队列的第一个是本线程时, 才尝试获取锁 */
        /* 否则, 将该线程扔到队列尾部 */
        if (!hasQueuedPredecessors() &&
            compareAndSetState(0, acquires)) {
            setExclusiveOwnerThread(current);
            return true;
        }
    }
    else if (current == getExclusiveOwnerThread()) {
        int nextc = c + acquires;
        if (nextc < 0)
            throw new Error("Maximum lock count exceeded");
        setState(nextc);
        return true;
    }
    return false;
}
#+END_SRC

hasQueuedPredecessors(): 当前是否有队列在等待
#+BEGIN_SRC java
public final boolean hasQueuedPredecessors() {
    // The correctness of this depends on head being initialized
    // before tail and on head.next being accurate if the current
    // thread is first in queue.
    Node t = tail; // Read fields in reverse initialization order
    Node h = head;
    Node s;
    return h != t && ((s = h.next) == null || s.thread != Thread.currentThread());
}
#+END_SRC

** unlock() 方法
跟 Nonfair 的版本一样

* 小结
- 　公平锁: 加锁时检查是否有等待的线程. 如果有则排队. 保证线程的获得锁是先到先得.
- 非公平锁: 加锁时直接尝试获取锁, 抢不到, 则排队.
至此, ReentrantLock 的主要代码都已看完, 通过这个类, 我们也简单的了解了一下 AQS 类的独占模式, 理解起来还是比较容易的.
