notebook/java/ReentrantLock.html
<div id="outline-container-orgc9e9f9e" class="outline-3">
<h3 id="orgc9e9f9e">lock() 方法</h3>
<div class="outline-text-3" id="text-orgc9e9f9e">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">ReentrantLock.java FairSync</span>
<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">lock</span>() {
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23545;&#27604; NonfairSync &#29256;&#26412;, &#36825;&#37324;&#30452;&#25509;&#35843;&#29992; acquire(), &#36991;&#20813;&#20102;&#32447;&#31243;&#25554;&#38431;&#30340;&#38382;&#39064;</span><span style="color: #5B6268;"> */</span>
    acquire(<span style="color: #da8548; font-weight: bold;">1</span>);
}

<span style="color: #51afef;">protected</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryAcquire</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Thread</span> <span style="color: #dcaeea;">current</span> = Thread.currentThread();
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">c</span> = getState();
    <span style="color: #51afef;">if</span> (c == <span style="color: #da8548; font-weight: bold;">0</span>) {
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#23545;&#27604; NonfairSync &#29256;&#26412;, &#21482;&#26377;&#36825;&#37324;&#22810;&#20102;&#19968;&#20010;&#21028;&#26029;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20165;&#26377;&#38431;&#21015;&#20026;&#31354; &#25110;&#32773; &#38431;&#21015;&#30340;&#31532;&#19968;&#20010;&#26159;&#26412;&#32447;&#31243;&#26102;, &#25165;&#23581;&#35797;&#33719;&#21462;&#38145;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21542;&#21017;, &#23558;&#35813;&#32447;&#31243;&#25172;&#21040;&#38431;&#21015;&#23614;&#37096;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>hasQueuedPredecessors() &amp;&amp;
            compareAndSetState(<span style="color: #da8548; font-weight: bold;">0</span>, acquires)) {
            setExclusiveOwnerThread(current);
            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
        }
    }
    <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> (current == getExclusiveOwnerThread()) {
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nextc</span> = c + acquires;
        <span style="color: #51afef;">if</span> (nextc &lt; <span style="color: #da8548; font-weight: bold;">0</span>)
            <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Error</span>(<span style="color: #98be65;">"Maximum lock count exceeded"</span>);
        setState(nextc);
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
}
</pre>
</div>

<p>
hasQueuedPredecessors(): 当前是否有队列在等待<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">hasQueuedPredecessors</span>() {
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The correctness of this depends on head being initialized</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">before tail and on head.next being accurate if the current</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">thread is first in queue.</span>
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">t</span> = tail; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Read fields in reverse initialization order</span>
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">h</span> = head;
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">s</span>;
    <span style="color: #51afef;">return</span> h != t &amp;&amp; ((s = h.next) == <span style="color: #a9a1e1;">null</span> || s.thread != Thread.currentThread());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a6600d" class="outline-3">
<h3 id="org1a6600d">unlock() 方法</h3>
<div class="outline-text-3" id="text-org1a6600d">
<p>
跟 Nonfair 的版本一样<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org8d741b9" class="outline-2">
<h2 id="org8d741b9">小结</h2>
<div class="outline-text-2" id="text-org8d741b9">
<ul class="org-ul">
<li>　公平锁: 加锁时检查是否有等待的线程. 如果有则排队. 保证线程的获得锁是先到先得.<br /></li>
<li>非公平锁: 加锁时直接尝试获取锁, 抢不到, 则排队.<br /></li>
</ul>
<p>
至此, ReentrantLock 的主要代码都已看完, 通过这个类, 我们也简单的了解了一下 AQS 类的独占模式, 理解起来还是比较容易的.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2022-01-13 Thu 22:47</p>
</div>
</body>
</html>
